Benchmark-Limitations/limitations/call-limited/sieve_artillery.yaml
# limitations/call-limited/sieve_artillery.yaml
config:
  phases:
    - duration: __DURATION__
      arrivalRate: __ARRIVALRATE__

scenarios:
  - flow:
      - post:
          url: "{{ target }}"
          json:
            num: __INPUT__
          capture:
            - json: "$.uniqueId"
              as: uniqueId
            - json: "$.num"
              as: num
            - json: "$.markColdStart"
              as: coldStart
          expect:
            - statusCode: 200
            - contentType: "application/json"
      - log: |
          Unique ID: {{ uniqueId }},
          Input: {{ num }},
          Cold Start: {{ coldStart }}
    name: "Sieve-of-Eratosthenes"